CPSC110/Problem_Sets/Module_1B_Questions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Module 1B Questions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Mao" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Module 1B Questions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd7174b7">Module 1B Questions</a>
<ul>
<li><a href="#org60fd52a">Full Speed HtDF Recipe</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Created on 2020-08-03/21:38
</p>


<p>
<a href="CPSC110/Module-1A.html">Module 1B Notes</a>
</p>

<div id="outline-container-orgd7174b7" class="outline-2">
<h2 id="orgd7174b7">Module 1B Questions</h2>
<div class="outline-text-2" id="text-orgd7174b7">
</div>
<div id="outline-container-org60fd52a" class="outline-3">
<h3 id="org60fd52a">Full Speed HtDF Recipe</h3>
<div class="outline-text-3" id="text-org60fd52a">
<ul class="org-ul">
<li><b>Question 1</b>
<ul class="org-ul">
<li>Does a design method (or recipe) help more with hard design problems or easier ones?
<ol class="org-ol">
<li><i>Hard design problems</i>  &lt;-</li>
<li>Easy design problems</li>
</ol></li>
</ul></li>
</ul>


<ul class="org-ul">
<li><b>Question 2</b>
<ul class="org-ul">
<li>Where can you find the steps of the HtDF design recipe?
<ol class="org-ol">
<li>In the DrRacket help desk</li>
<li>In the starter file</li>
<li><i>By following the Design Recipes tab from the course web site</i>  &lt;-</li>
</ol></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Mao</p>
</div>
</body>
</html>
